In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
import seaborn as sns

In [4]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [5]:
df = sns.load_dataset('tips')

In [6]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
total_bill_group = df.groupby('time')['total_bill'].sum()
avg_bill_group = df.groupby('time')['total_bill'].mean()

C:\Users\francis\AppData\Local\Temp\ipykernel_31032\4025466990.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  total_bill_group = df.groupby('time')['total_bill'].sum()
C:\Users\francis\AppData\Local\Temp\ipykernel_31032\4025466990.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_bill_group = df.groupby('time')['total_bill'].mean()

In [8]:
print(avg_bill_group)

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [9]:
print(total_bill_group)

time
Lunch     1167.47
Dinner    3660.30
Name: total_bill, dtype: float64

In [10]:
df1 = pd.read_csv('Flavors.csv')

In [11]:
print(df1)

                   Flavor Base Flavor Liked  Flavor Rating  Texture Rating  \
0     Mint Chocolate Chip     Vanilla   Yes           10.0             8.0
1               Chocolate   Chocolate   Yes            8.8             7.6
2                 Vanilla     Vanilla    No            4.7             5.0
3            Cookie Dough     Vanilla   Yes            6.9             6.5
4              Rocky Road   Chocolate   Yes            8.2             7.0
5               Pistachio     Vanilla    No            2.3             3.4
6             Cake Batter     Vanilla   Yes            6.5             6.0
7              Neapolitan     Vanilla    No            3.8             5.0
8  Chocolte Fudge Brownie   Chocolate   Yes            8.2             7.1

   Total Rating
0          18.0
1          16.6
2           9.7
3          13.4
4          15.2
5           5.7
6          12.5
7           8.8
8          15.3

In [12]:
group_by_frame = df1.groupby('Base Flavor')

In [13]:
group_by_frame[['Flavor Rating','Texture Rating','Total Rating']].mean()

             Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate              8.4        7.233333         15.70
Vanilla                5.7        5.650000         11.35

In [14]:
df1.groupby('Base Flavor').count()

             Flavor  Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate         3      3              3               3             3
Vanilla           6      6              6               6             6

In [15]:
df1.groupby('Base Flavor').min()

                  Flavor Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate      Chocolate   Yes            8.2             7.0          15.2
Vanilla      Cake Batter    No            2.3             3.4           5.7

In [16]:
df1.groupby('Base Flavor').max()

                 Flavor Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate    Rocky Road   Yes            8.8             7.6          16.6
Vanilla         Vanilla   Yes           10.0             8.0          18.0

In [19]:
df = pd.DataFrame({
    'Department':['Sales','Sales','IT','IT','HR'],
    'Employee':['Alice','Bob','Charlie','David','Eva'],
    'Salary':[50000,60000,700000,800000,450000],
    'Bonus':[5000,6000,4000,3000,2000]
})

result = df.groupby('Department').agg({
    'Salary':['mean','max'],
    'Bonus':['sum','min']
})

In [20]:
print(result)

              Salary          Bonus
                mean     max    sum   min
Department
HR          450000.0  450000   2000  2000
IT          750000.0  800000   7000  3000
Sales        55000.0   60000  11000  5000

In [21]:
def top_earner(group):
    return group.sort_values(by='Salary',ascending=False).head(1)

In [22]:
df.groupby('Department').apply(top_earner)

C:\Users\francis\AppData\Local\Temp\ipykernel_31032\2606043627.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Department').apply(top_earner)

             Department Employee  Salary  Bonus
Department
HR         4         HR      Eva  450000   2000
IT         3         IT    David  800000   3000
Sales      1      Sales      Bob   60000   6000

In [23]:
df.groupby(['Department','Employee']).sum()

                     Salary  Bonus
Department Employee
HR         Eva       450000   2000
IT         Charlie   700000   4000
           David     800000   3000
Sales      Alice      50000   5000
           Bob        60000   6000

In [24]:
df2 = pd.DataFrame({
    'Region':['North','South','North','West','South'],
    'Product':['A','A','B','B','C'],
    'Category':['TECH','TECH','TECH','Furniture','Furniture'],
    'Revenue':[200,300,250,400,100],
    'Quantity':[2,3,1,4,1]
})

In [26]:
df2.groupby('Product')['Revenue'].sum()

Product
A    500
B    650
C    100
Name: Revenue, dtype: int64

In [28]:
df2.groupby('Category')['Revenue'].mean()

Category
Furniture    250.0
TECH         250.0
Name: Revenue, dtype: float64

In [30]:
df2.groupby(['Region','Product'])['Revenue'].sum()

Region  Product
North   A          200
        B          250
South   A          300
        C          100
West    B          400
Name: Revenue, dtype: int64

In [32]:
df3  =pd.DataFrame({
    'Name':['Alice','Bob','Charlie','David','Eve'],
    'Department':['HR','IT','IT','SALE','SALE'],
    'Salary':[50000,60000,700000,550000,520000],
    'Performance':[8,9,7,6,9]

})

In [33]:
df3.groupby('Department')['Salary'].mean()

Department
HR       50000.0
IT      380000.0
SALE    535000.0
Name: Salary, dtype: float64

In [34]:
df3.groupby('Department').apply(lambda x: x.nlargest(1,'Performance'))

C:\Users\francis\AppData\Local\Temp\ipykernel_31032\3380274483.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df3.groupby('Department').apply(lambda x: x.nlargest(1,'Performance'))

               Name Department  Salary  Performance
Department
HR         0  Alice         HR   50000            8
IT         1    Bob         IT   60000            9
SALE       4    Eve       SALE  520000            9

In [35]:
df3['Department'].value_counts()

Department
IT      2
SALE    2
HR      1
Name: count, dtype: int64

In [36]:
df5 = pd.DataFrame({
    'Date':pd.date_range('2024-01-01',periods=6),
    'Stock':['AAPL','AAPL','MSFT','MSFT','GOOG','GOOG'],
    'Sector':['TECH','TECH','TECH','TECH','TECH','TECH'],
    'Daily_Return':[0.01,0.02,-0.01,0.03,0.00,0.01],
    'Price':[150,153,280,288,130,131]
})

In [37]:
df5.groupby('Stock')['Daily_Return'].mean()

Stock
AAPL    0.015
GOOG    0.005
MSFT    0.010
Name: Daily_Return, dtype: float64

In [39]:
df5['Cumulative_Return'] = df5.groupby('Stock')['Daily_Return'].cumsum()

In [40]:
print(df5)

        Date Stock Sector  Daily_Return  Price  Cumulative_Return
0 2024-01-01  AAPL   TECH          0.01    150               0.01
1 2024-01-02  AAPL   TECH          0.02    153               0.03
2 2024-01-03  MSFT   TECH         -0.01    280              -0.01
3 2024-01-04  MSFT   TECH          0.03    288               0.02
4 2024-01-05  GOOG   TECH          0.00    130               0.00
5 2024-01-06  GOOG   TECH          0.01    131               0.01

In [41]:
d6 = pd.DataFrame({
    'PatientID':[1,2,3,4,5],
    'Diagnosis':['Diabetes','Hypertension','Diabetes','Astham','Astham'],
    'Age':[45,60,50,25,30],
    'Dosage':[50,30,40,20,10]
})

In [42]:
d6['Diagnosis'].value_counts()

Diagnosis
Diabetes        2
Astham          2
Hypertension    1
Name: count, dtype: int64

In [43]:
d6.groupby('Diagnosis')['Age'].mean()

Diagnosis
Astham          27.5
Diabetes        47.5
Hypertension    60.0
Name: Age, dtype: float64

In [ ]:
d6.groupby('Diagnosis')['Dosage'].sum()

In [ ]:
df = pd.DataFrame({
    'Date':pd.date_range(start='2024-01-01',periods=10,freq='D'),
    'Product':['A','B'] * 5,
    'Sale':[10,15,12,17,14,18,13,16,12,20]
})

df['Month'] = df['Date'].dt.to_period('M')

df.group(['Month','Product'])['Sales'].sum()

In [44]:
df = pd.DataFrame({
    'User':['u1','u1','u2','u2','u3'],
    'Page':['Home','Product','Home','Product','Home'],
    'TimeOnPage':[10,20,15,25,30],
    'Source':['Google','Google','Facebook','Facebook','Google']
})

In [45]:
df['User'].value_counts()

User
u1    2
u2    2
u3    1
Name: count, dtype: int64

In [46]:
df.groupby('Page')['TimeOnPage'].mean()

Page
Home       18.333333
Product    22.500000
Name: TimeOnPage, dtype: float64

In [47]:
df.groupby('Source')['User'].nunique()

Source
Facebook    1
Google      2
Name: User, dtype: int64

In [48]:
df = pd.DataFrame({
    'Region':['East','East','West','West','Nort'],
    'Saleperson':['Alice','Bob','Charlie','David','Eva'],
    'Revenue':[300,400,500,450,600]
})

df['Rank_in_Region'] = df.groupby('Region')['Revenue'].rank(ascending=False)

In [49]:
print(df)

  Region Saleperson  Revenue  Rank_in_Region
0   East      Alice      300             2.0
1   East        Bob      400             1.0
2   West    Charlie      500             1.0
3   West      David      450             2.0
4   Nort        Eva      600             1.0

In [57]:
df = pd.DataFrame({
    'Store':['A','A','A','B','B','B'],
    'Date':pd.date_range('2023-01-01',periods=6),
    'Sales':[100,120,110,90,95,130]
})

In [58]:
df['SalesChange'] = df.groupby('Store')['Sales'].diff()

In [59]:
print(df)

  Store       Date  Sales  SalesChange
0     A 2023-01-01    100          NaN
1     A 2023-01-02    120         20.0
2     A 2023-01-03    110        -10.0
3     B 2023-01-04     90          NaN
4     B 2023-01-05     95          5.0
5     B 2023-01-06    130         35.0

In [60]:
df = pd.DataFrame({
    'Region':['East','East','West','West','Nort'],
    'Saleperson':['Alice','Bob','Charlie','David','Eva'],
    'Revenue':[300,400,500,450,600]
})

In [61]:
group_avg = df.groupby('Region')['Revenue'].transform('mean')
group_std = df.groupby('Region')['Revenue'].transform('std')

In [62]:
print(group_avg)

0    350.0
1    350.0
2    475.0
3    475.0
4    600.0
Name: Revenue, dtype: float64

In [63]:
print(group_std)

0    70.710678
1    70.710678
2    35.355339
3    35.355339
4          NaN
Name: Revenue, dtype: float64

In [64]:
df['Z_score'] = (df['Revenue'] - group_avg) / group_std

In [65]:
print(df)

  Region Saleperson  Revenue   Z_score
0   East      Alice      300 -0.707107
1   East        Bob      400  0.707107
2   West    Charlie      500  0.707107
3   West      David      450 -0.707107
4   Nort        Eva      600       NaN

In [66]:
outliers = df[df['Z_score'] > 1.5]

In [67]:
print(outliers)

Empty DataFrame
Columns: [Region, Saleperson, Revenue, Z_score]
Index: []

In [68]:
df = pd.DataFrame({
    'Department':['HR','HR','IT','IT','SALES','SALES'],
    'Gender':['M','F','M','F','M','F'],
    'Salary':[50000,55000,60000,62000,58000,61000]
})

df.groupby(['Department','Gender'])['Salary'].agg(['mean','max','min'])

                      mean    max    min
Department Gender
HR         F       55000.0  55000  55000
           M       50000.0  50000  50000
IT         F       62000.0  62000  62000
           M       60000.0  60000  60000
SALES      F       61000.0  61000  61000
           M       58000.0  58000  58000

In [78]:
df = pd.DataFrame({
    'Date':pd.date_range('2023-01-01',periods=6),
    'Stock':['AAPL'] * 3 + ['MSFT'] * 3,
    'Price':[150,153,155,280,282,285],
    'Region':['South','South','North','North','South','North'],
    'Product':['Phone','Phone','Phone','Computer','Computer','Computer'],
    'Revenue':[10000,23120,30000,15000,12340,21000]
})

In [79]:
df['RollingAvg'] = df.groupby('Stock')['Price'].rolling(3).mean().reset_index(0,drop=True)

In [80]:
print(df)

        Date Stock  Price Region   Product  Revenue  RollingAvg
0 2023-01-01  AAPL    150  South     Phone    10000         NaN
1 2023-01-02  AAPL    153  South     Phone    23120         NaN
2 2023-01-03  AAPL    155  North     Phone    30000  152.666667
3 2023-01-04  MSFT    280  North  Computer    15000         NaN
4 2023-01-05  MSFT    282  South  Computer    12340         NaN
5 2023-01-06  MSFT    285  North  Computer    21000  282.333333

In [81]:
df.groupby(['Region','Product'])['Revenue'].sum().unstack()

Product  Computer  Phone
Region
North       36000  30000
South       12340  33120

In [82]:
def top_above_avg(group):
    avg = group['Revenue'].mean()
    top = group.loc[group['Revenue'] > avg ]
    return top.sort_values(by='Revenue',ascending=False).head(1)


df.groupby('Region').apply(top_above_avg)

C:\Users\francis\AppData\Local\Temp\ipykernel_31032\2591757982.py:7: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Region').apply(top_above_avg)

               Date Stock  Price Region Product  Revenue  RollingAvg
Region
North  2 2023-01-03  AAPL    155  North   Phone    30000  152.666667
South  1 2023-01-02  AAPL    153  South   Phone    23120         NaN

In [83]:
df = pd.DataFrame({
    'Class':['A','A','B','B'],
    'Student':['X','Y','Z','W'],
    'Score':[90,None,85,None]
})

In [86]:
df['Score_filled'] = df.groupby('Class')['Score'].transform(lambda x: x.fillna(x.mean()))

In [87]:
print(df)

  Class Student  Score  Score_filled
0     A       X   90.0          90.0
1     A       Y    NaN          90.0
2     B       Z   85.0          85.0
3     B       W    NaN          85.0

In [88]:
def min_max(x):
    return (x - x.min()) / (x.max() - x.min())

In [90]:
df['Normalized'] = df.groupby('Class')['Score'].transform(min_max)

In [91]:
print(df)

  Class Student  Score  Score_filled  Normalized
0     A       X   90.0          90.0         NaN
1     A       Y    NaN          90.0         NaN
2     B       Z   85.0          85.0         NaN
3     B       W    NaN          85.0         NaN

In [92]:
df = pd.DataFrame({
    'Campaign':['A','A','B','B','A','C'],
    'UserID':[101,102,103,104,101,105]
})

In [93]:
df.groupby('Campaign')['UserID'].unique()

Campaign
A    [101, 102]
B    [103, 104]
C         [105]
Name: UserID, dtype: object

In [94]:
df = pd.DataFrame({
    'ProductID':[1,1,2,2,3],
    'Returned':[0,1,1,0,0]
})

In [95]:
df.groupby('ProductID')['Returned'].mean()

ProductID
1    0.5
2    0.5
3    0.0
Name: Returned, dtype: float64

In [96]:
df = pd.DataFrame({
    'Team':['Red','Red','Blue','Blue','Green','Red','Blue'],
    'Player':['A','B','C','D','E','F','G'],
    'Score':[10,15,20,18,5,25,30]
})

In [97]:
filtered = df.groupby('Team').filter(lambda g: len(g) >= 3)

In [98]:
result = filtered.groupby('Team')['Score'].sum()

In [99]:
print(filtered)
print(result)

   Team Player  Score
0   Red      A     10
1   Red      B     15
2  Blue      C     20
3  Blue      D     18
5   Red      F     25
6  Blue      G     30
Team
Blue    68
Red     50
Name: Score, dtype: int64

In [100]:
df['Rank'] = df.groupby('Team')['Score'].rank(method='min',ascending=False)

In [101]:
print(df)

    Team Player  Score  Rank
0    Red      A     10   3.0
1    Red      B     15   2.0
2   Blue      C     20   2.0
3   Blue      D     18   3.0
4  Green      E      5   1.0
5    Red      F     25   1.0
6   Blue      G     30   1.0

In [103]:
df = pd.DataFrame({
    'Student':['Alice','Bob','Alice','Bob'],
    'Subject':['Math','Math','English','English'],
    'Score':[80,90,85,95],
    'credits':[3,3,2,2]
})


df.groupby('Student').apply(lambda g: (g['Score'] * g['credits']).sum() / g['credits'].sum())

C:\Users\francis\AppData\Local\Temp\ipykernel_31032\2141195168.py:9: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Student').apply(lambda g: (g['Score'] * g['credits']).sum() / g['credits'].sum())

Student
Alice    82.0
Bob      92.0
dtype: float64

In [104]:
df = pd.DataFrame({
    'UserID':[1,1,2,2],
    'OrderID':['A1','A2','B1','B2'],
    'Amount':[50,100,30,70]
})

In [105]:
grouped = df.groupby('UserID').apply(
    lambda x: x[['OrderID','Amount']].to_dict('records')
).to_dict()

C:\Users\francis\AppData\Local\Temp\ipykernel_31032\507754941.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped = df.groupby('UserID').apply(

In [107]:
print(grouped)

{1: [{'OrderID': 'A1', 'Amount': 50}, {'OrderID': 'A2', 'Amount': 100}], 2: [{'OrderID': 'B1', 'Amount': 30}, {'OrderID': 'B2', 'Amount': 70}]}

In [109]:
df = pd.DataFrame({
    'UserID':[1,1,2,2,2],
    'IP': ['10.0.0.1', '10.0.0.1', '10.0.0.2', '10.0.0.3', '10.0.0.2']
})

df['is_duplicate'] = df.duplicated(subset=['UserID','IP'])

In [110]:
print(df)

   UserID        IP  is_duplicate
0       1  10.0.0.1         False
1       1  10.0.0.1          True
2       2  10.0.0.2         False
3       2  10.0.0.3         False
4       2  10.0.0.2          True